Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་ལ་མཉམ་པ་ཉིད་གང་ཞེ་ན། ལྟ་བའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཏུ་མཉམ་མོ། ། མཚན་མའི་ངོ་བོ་ཉིད་ཀྱིས་མཚན་མ་མེད་པར་མཉམ་མོ། ། ཁམས་གསུམ་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྨོན་པ་མེད་པར་མཉམ་མོ། ། སྐྱེ་བའི་ངོ་བོ་ཉིད་ཀྱིས་མི་སྐྱེ་བར་མཉམ་མོ། ། མངོན་པར་འདུ་བྱེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་མངོན་པར་འདུ་མི་བྱེད་པར་མཉམ་མོ། ། འབྱུང་བའི་ངོ་བོ་ཉིད་ཀྱིས་མི་འབྱུང་བར་མཉམ་མོ། ། ཀུན་གཞིའི་ངོ་བོ་ཉིད་ཀྱིས་ཀུན་གཞི་མེད་པར་མཉམ་མོ། ། དུས་གསུམ་གྱི་ངོ་བོ་ཉིད་ཀྱིས་ཇི་ལྟ་བ་བཞིན་དུ་མཉམ་མོ། ། མ་རིག་པ་དང་། སྲིད་པ་དང་། སྲེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་རིག་པ་དང་། རྣམ་པར་གྲོལ་བར་མཉམ་མོ། ། འཁོར་བའི་ངོ་བོ་ཉིད་ཀྱིས་མྱ་ངན་ལས་འདས་པར་མཉམ་མོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཉམ་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །
en: “What is sameness in this context? The sameness of emptiness is because of the essential identity of views. The sameness of freedom from attributes is because of the essential identity of attributes. The sameness of freedom from aspirations is because of the essential identity of the three realms. The sameness of the unborn is because of the essential identity of birth. The sameness of nonfabrication is because of the essential identity of fabrications. The sameness of nonarising is because of the essential identity of arising. The sameness of no foundation is because of the essential identity of the foundation. The sameness of the way things really are is because of the essential identity of the three times. The sameness of awareness and liberation is because of the essential identity of ignorance, becoming, and grasping. The sameness of nirvāṇa is because of the essential identity of saṃsāra. Śāriputra, the Tathāgata’s full understanding of all phenomena is like this, and that is why the Tathāgata is called a fully accomplished buddha.

source: དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་དེ་ཡང་འཁོར་ཐམས་ཅད་ཤེས་པར་བྱེད་པ། འཁོར་ཐམས་ཅད་མགུ་བར་བྱེད་པ། འཁོར་ཐམས་ཅད་ཀྱི་ལུས་སིམ་པར་བྱེད་པ། འཁོར་ཐམས་ཅད་ཀྱི་སེམས་ཚིམ་པ་སྐྱེད་པ། འཁོར་ཐམས་ཅད་དགའ་བ་དང་། རབ་ཏུ་དགའ་བ་དང་དད་པ་སྐྱེད་པ། སྙིང་རྗེ་ཆེན་པོས་སྦྱོར་བ། དེ་བཞིན་ཉིད་ཀྱིས་མཉམ་པ། དེ་ཁོ་ན་ཉིད། དེ་བཞིན་ཉིད། གཞན་མ་ཡིན་པ་ཉིད། མི་འགྱུར་བ་ཉིད། མི་འཁྲུགས་པ་ཉིད། འབྱུང་བ་མེད་པ་ཉིད། འཇིག་པ་མེད་པ་ཉིད། རྩོད་པ་མེད་པ་ཉིད་དེ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ལ་རྩོད་པ་གང་ཡང་མེད་དོ། ། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ནི་རྩོད་པ་མེད་པ་འཐབ་པ་མེད་པའོ། ། དེ་བཞིན་ཉིད་ཀྱིས་མཉམ་ཞིང་ཆོས་ཀྱི་དབྱིངས་ངོས་མཉམ་པ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་མ་ལུས་པ་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པའོ། ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་འདི་ལྟ་བུའི་ཆོས་ཟབ་མོ་ཕྲ་བ། ཤེས་པར་དཀའ་བ་དེ་དག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་བཞིན་དུ་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ནས་ བསྟན་པ་སྣ་ཚོགས་དང་། རྣམ་གྲངས་སྣ་ཚོགས་ཀྱི་སེམས་ཅན་གཞན་རྣམས་དང་། གང་ཟག་གཞན་དག་ལ་ཆོས་ཐམས་ཅད་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ དེའི་ཆོས་དེ་ཡང་དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པའི་ཕྱིར་འབྱུང་ངོ་། ། གང་སྟོན་པ་མ་ཡིན་ལ་སྟོན་པའོ་ཞེས་ཁས་འཆེ་བ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་ཡིན་ལ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་ཁས་འཆེ་བ་དེ་དག་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པས་ཟིལ་གྱིས་ནོན་ནས་ དེ་དག་རྒྱགས་པ་ཆད་དེ་ ཕན་ཚུན་དུ་འབྲོས་སོ།
en: “This confidence of the Tathāgata is known in all assemblies. It satisfies all assemblies, refreshes all assemblies, exhilarates all assemblies, and gladdens, delights, and engages all assemblies. It is the practice of great compassion, and it is the same as the nature of things, real, actual, not inaccurate, unchanging, and imperturbable. It does not appear or perish. It is indisputable, as no one can dispute the confidence of the Tathāgata. One cannot challenge the indisputable confidence of the Tathāgata. It is the same as the nature of things, the same as the face of the totality of phenomena, unobstructed in all the vast stretches of the ten directions of the world. Just as the Tathāgata has attained complete realization of all these deep and subtle phenomena that are difficult to grasp, his great compassion, too, is firm, and he teaches other sentient beings and other people by means of various kinds of instructions and various methods. His Dharma appears for the purpose of the genuine elimination of suffering. He pledges to be a teacher for those who have not been taught. He pledges to be a fully accomplished awakened one for those who have not fully accomplished awakening. They are outshone by the confidence of the Tathāgata, and those whose pride receives a blow flee in all directions.

source: འདི་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་མཐའ་ཡས་མུ་མེད་དེ། འདི་ལྟ་སྟེ། ནམ་མཁའ་མཐའ་ཡས་མུ་མེད་པ་དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ཡང་མཐའ་ཡས་མུ་མེད་དོ། ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པའི་མཐའ་འདོད་པ་ནི་ནམ་མཁའི་མཐའ་འདོད་དོ། ། བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ཐོས་ནས་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག་པ་ནས་ངོ་མཚར་དང་། རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་དེ་འདི་ནི་མི་འཇིགས་པ་དང་པོའོ། །
en: “Thus, Śāriputra, the confidence of the Tathāgata is boundless. Just as space is boundless, Śāriputra, so, too, is the confidence of the Tathāgata boundless. Śāriputra, if one could claim that there is a limit to space, then one could also claim to find a limit to the Tathāgata’s confidence. When the bodhisatva learns of this inconceivable confidence of the Tathāgata, he develops great faith, trust, and confidence, and he considers it to be truly wondrous and extraordinary. This is the first confidence.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བླ་ན་ མེད་པའི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་ལྡན་པས་འཁོར་གྱི་ནང་དུ་གཤེགས་ནས་ ངའི་ཟག་པ་ཟད་དོ་ཞེས་ཞལ་གྱིས་འཆེ་སྟེ། དེ་ལ་ཁྱོད་ཀྱི་ཟག་པ་འདི་དག་མ་ཟད་དོ་ཞེས་དེ་བཞིན་གཤེགས་པ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཆོས་དང་འཐུན་པས་རྩོད་པར་བྱེད་པ་མེད་དོ། །
en: “Furthermore, Śāriputra, the Tathāgata possesses the unsurpassed tathāgata knowledge, and when he is in the midst of the assembly and asserts, ‘I have eliminated the defilements,’ the world with its gods, and so forth is not able to challenge the Tathāgata legitimately, saying, ‘You have not fully eliminated the defilements.’

source: དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་ནི་འདི་དག་སྟེ། དེ་བཞིན་གཤེགས་པའི་འདོད་པའི་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་བས་འདོད་ཆགས་ལ་སྤྱོད་པའི་བག་ཆགས་ཐམས་ཅད་བཅོམ་མོ། ། སྲིད་པའི་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་བས་ཞེ་སྡང་ལ་སྤྱོད་པའི་བག་ཆགས་ཐམས་ཅད་བཅོམ་མོ། ། མ་རིག་པའི་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་བས་གཏི་མུག་ལ་སྤྱོད་པའི་བག་ཆགས་ཐམས་ཅད་བཅོམ་མོ། ། ལྟ་བའི་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་བས་ཉོན་མོངས་པ་སྤྱོད་པའི་བག་ཆགས་ཐམས་ཅད་བཅོམ་སྟེ། དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་བཟུང་སྟེ། དེ་བཞིན་གཤེགས་པ་ཟག་པ་ཟད་པའོ་ཞེས་བྱའོ། ། དོན་དམ་པར་ན་འཕགས་པའི་ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱི་མདུན་ན་ཆོས་གང་ཡོངས་སུ་ཤེས་པའམ། སྤང་བའམ། བསྒོམ་པ་འམ། མངོན་དུ་བྱ་བར་འགྱུར་བའི་ཆོས་གང་ཡང་མི་འདུག་གོ ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་ཟད་པ་ཞེས་བྱ་བ་དེ་ནི་ནམ་དུ་ཡང་མི་ཟད་པ་མ་ཡིན་ནོ། ། དེ་ནི་ཤིན་ཏུ་ཟད་པ་ཉིད་ཡིན་གྱི། གཉེན་པོས་ཟད་པ་ཞེས་མི་བྱ་སྟེ། དེ་ནི་ཇི་ལྟ་བ་བཞིན་དུ་ཟད་པའོ། ། གང་ཇི་ལྟ་བ་བཞིན་དུ་ཟད་པ་དེ་ལ་ཟད་པ་གང་ཡང་མེད་དོ། ། གང་ལ་ཟད་པ་གང་ཡང་མེད་པ་དེ་འདུས་མ་བྱས་པའོ། ། དེ་ལ་སྐྱེ་བ་མེད་པ། འཇིག་པ་མེད་པ། གནས་པ་མེད་དེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་བྱུང་ཡང་རུང་། མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་ཉིད་ཆོས་ཀྱི་དབྱིངས་ནི་གནས་པ་ཉིད་དེ། དེ་བཞིན་དུ་དེ་ལ་ཡེ་ཤེས་ཞུགས་སོ། ། གང་ལ་འཇུག་པ་མེད་ཅིང་མི་འཇུག་པ་ཡང་མེད་པ་ཡང་དེ་ལྟར་ཞུགས་ཏེ། དེ་ལྟ་བུའི་ཆོས་ཀྱི་ཚུལ་གྱིས་ཟག་པ་དང་ཟད་པ་སྤོང་བ་མི་དམིགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ནས་ཟག་པ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: “The Tathāgata’s elimination of the defilements is such that the mind of the Tathāgata is freed from the defilement of attachment, as he has overcome all tendencies toward acting from desire. His mind is freed from the defilement of becoming, as he has overcome all tendencies toward acting from anger. His mind is freed from the defilement of ignorance, as he has overcome all tendencies toward acting from confusion. His mind is freed from the defilement of views, as he has overcome all tendencies toward acting from any kind of vice. Therefore, according to worldly conventions, it is said that the Tathāgata has eliminated the defilements. Still, from the perspective of a noble one with his wisdom and knowledge, there is ultimately no phenomenon anywhere tat can be ascertained, renounced, practiced, or realized. How so? While one might think that elimination takes place, it has never been the case that elimination was absent. Even though the defilements are completely eliminated, one cannot say that they are eliminated by means of an antidote. They are truly eliminated, but that which is truly eliminated is not a thing that is eliminated. That which is a thing that is not eliminated is uncompounded. It does not appear, decay, or remain. Therefore, one can say that whether the tathāgatas appear or not, this is the nature of things, this is the totality of phenomena, and this is how the Tathāgata’s knowledge works. In this process, his knowledge is not involved with anything and does not abstain from anything. The defilements and the removal of the defilements are not apprehended by means of any particular sort of phenomenon. Thus, steeped in great compassion, the Tathāgata teaches the Dharma in order to remove the defilements.

source: དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་དེ་ནི་འཁོར་ཐམས་ཅད་ཤེས་པར་བྱེད་པ། འཁོར་ཐམས་ཅད་མགུ་བར་བྱེད་པ། འཁོར་ཐམས་ཅད་ཀྱི་ལུས་སིམ་པར་བྱེད་པ། འཁོར་ཐམས་ཅད་ཀྱི་སེམས་ཚིམ་པ་སྐྱེད་པ། འཁོར་ཐམས་ཅད་དགའ་བ་དང་། རབ་ཏུ་དགའ་བ་དང་། དད་པ་སྐྱེད་པ། སྙིང་རྗེ་ཆེན་པོས་སྦྱོར་བ། དེ་བཞིན་ཉིད་ཀྱིས་མཉམ་པ། དེ་ཁོ་ན་ཉིད། དེ་བཞིན་ཉིད། གཞན་མ་ཡིན་པ་ཉིད། མི་འགྱུར་བ་ཉིད། མི་འཁྲུགས་པ་ཉིད། འབྱུང་བ་མེད་པ་ཉིད། འཇིག་པ་མེད་པ་ཉིད། །རྩོད་པ་མེད་པ་ཉིད་དེ། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ལ་རྩོད་པ་གང་ཡང་མེད་དོ། ། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ནི་རྩོད་པ་མེད་པ་འཐབ་པ་མེད་པའོ། ། དེ་བཞིན་ཉིད་ཀྱིས་མཉམ་ཞིང་ཆོས་ཀྱི་དབྱིངས་ངོས་མཉམ་པ། འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་མ་ལུས་པ་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་དོ། ། དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ། གྲངས་མེད། དཔག་ཏུ་མེད་པའི་ཆོས་དང་ལྡན་ཞིང་སྙིང་རྗེ་ཆེན་པོས་ཡང་དག་པར་ཟིན་པའི་སེམས་ཀྱིས་ཟག་པ་སྤང་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: “This confidence of the Tathāgata is known in all assemblies. It satisfies all assemblies, refreshes all assemblies, exhilarates all assemblies, and gladdens, delights, and engages all assemblies. It is the practice of great compassion, and it is the same as the nature of things, real, actual, not inaccurate, unchanging, and imperturbable. It does not appear or perish. It is indisputable, as no one can dispute the confidence of the Tathāgata. One cannot challenge the indisputable confidence of the Tathāgata. It is the same as the nature of things, the same as the face of the totality of phenomena, and unobstructed in all the vast stretches of the ten directions of the world. Thus, the Tathāgata possesses inconceivable, immeasurable, innumerable, limitless qualities and a mind filled with great compassion, and he teaches the Dharma to sentient beings for the removal of their defilements.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་མཐའ་ཡས་པ་ནས། གང་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པའི་མཐའ་འདོད་པ་དེ་ནམ་མཁའི་མཐའ་འདོད་དོ་ཞེས་བྱ་བའི་བར་དུ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ཐོས་ནས་ མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག་པ་ནས། ངོ་མཚར་དང་རྨད་ཀྱི་བར་གྱི་འདུ་ཤེས་སྐྱེད་དོ། །
en: “Thus, Śāriputra, the confidence of the Tathāgata is boundless. Just as space is boundless, Śāriputra, so, too, is the confidence of the Tathāgata boundless. Śāriputra, if one could claim that there is a limit to space, then one could also claim to find a limit to the Tathāgata’s confidence. When the bodhisatva learns of this inconceivable confidence of the Tathāgata, he develops great faith, trust, and confidence, and so forth, and he considers it to be truly wondrous and extraordinary. This is the second tathāgata confidence, and in possession of this confidence the Tathāgata, and so forth, until as nobody in this world has legitimately turned.

source: ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་གཉིས་པ་སྟེ། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་དེ་དང་ལྡན་ཞེས་བྱ་བ་ནས། འཇིག་རྟེན་འདིར་ཆོས་དང་འཐུན་པར་ཞེས་བྱ་བའི་བར་དུའོ། །གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བླ་ན་ མེད་པའི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་ལྡན་པས། འཁོར་གྱི་ནང་དུ་གཤེགས་ནས་ བར་དུ་གཅོད་པའི་ཆོས་རྣམས་ལ་བར་དུ་གཅོད་དོ་ཞེས་ཞལ་གྱིས་འཆེ་བ་དེ་ལ་གོང་མ་བཞིན་དུ་སྦྱར་ཏེ དེ་བཞིན་གཤེགས་པ་ལ་ལྷར་བཅས་པའི་འཇིག་རྟེན་གྱིས་འདི་ནི་བར་དུ་གཅོད་པའི་ཆོས་མ་ཡིན་ནོ་ཞེས་རྒོལ་བར་བྱེད་པ་མེད་པའི་བར་དུའོ།
en: “Furthermore, Śāriputra, the Tathāgata possesses the unsurpassed tathāgata knowledge, and when he is in the midst of the assembly and asserts, ‘the hindering conditions are hinderances,’ the world with its gods, and so forth are not able to legitimately challenge the Tathāgata saying, ‘These are not hindering conditions.’

source: །དེ་ལ་བར་དུ་གཅོད་པའི་ཆོས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་གཅིག་སྟེ། གཅིག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བག་མེད་པའི་སེམས་སོ། །
en: “What are the hinderances? There is essentially one phenomenon that is a hinderance. What is it? It is the heedless mind.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་གཉིས་ཏེ། གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ངོ་ཚ་མི་ཤེས་པ་དང་། ཁྲེལ་མེད་པའོ། །
en: “There are two phenomena that are hinderances. What are they? They are lack of conscience and lack of moral sensitivity.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་གསུམ་སྟེ། གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་ཀྱིས་ཉེས་པར་སྤྱད་པ་དང་། ངག་གིས་ཉེས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱད་པའོ། །
en: “There are three phenomena that are hinderances. What are they? They are bodily misconduct, verbal misconduct, and mental misconduct.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་བཞི་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་བཞི་ལ་འདུན་པས་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། འཇིགས་པས་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བའོ། །
en: “There are four phenomena that are hinderances. What are they? They are the four wrong ways of approaching things: approaching things with yearning and approaching things with anger, confusion, or fear.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་ལྔ་སྟེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཆང་འཐུང་བའོ། །
en: “There are five phenomena that are hinderances. What are they? They are taking life, taking what is not given, sexual misconduct, lying, and intoxication.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་དྲུག་སྟེ། དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་ལ་མ་གུས་པ་དང་། ཆོས་དང་། དགེ་འདུན་དང་། བསླབ་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཏོང་བ་ལ་མ་གུས་པའོ། །
en: “There are six phenomena that are hinderances. What are they? They are not having reverence for the Buddha and not having reverence for the Dharma, the Saṅgha, the training, concentration, and generosity.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་བདུན་སྟེ། བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ང་རྒྱལ་དང་། ཆེ་བའི་ང་རྒྱལ་དང་། ང་རྒྱལ་ལས་ཀྱང་ང་རྒྱལ་དང་། ངའོ་སྙམ་པའི་ང་རྒྱལ་དང་། ལོག་པའི་ང་རྒྱལ་དང་། མངོན་པའི་ང་རྒྱལ་དང་། ཆུང་ཟད་སྙམ་པའི་ང་རྒྱལ་ལོ། །
en: “There are seven phenomena that are hinderances. What are they? They are pride, arrogance, haughtiness, self-conceit, taking pride in faults, the pride of superiority, and the pride of inferiority.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་བརྒྱད་དེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལོག་པའི་ལྟ་བ་དང་། ལོག་པའི་རྟོག་པ་དང་། ལོག་པའི་ངག་དང་། ལོག་པའི་ལས་ཀྱི་མཐའ་དང་། ལོག་པའི་འཚོ་བ་དང་། ལོག་པའི་རྩོལ་བ་དང་། ལོག་པའི་དྲན་པ་དང་། ལོག་པའི་ཏིང་ངེ་འཛིན་ཏོ། །
en: “There are eight phenomena that are hinderances. What are they? They are wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, and wrong concentration.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་དགུ་སྟེ། དགུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བདག་ལ་གནོད་པ་བྱས་སོ་ཞེས་ཀུན་ནས་མནར་སེམས་སྐྱེད་པ་དང་། གནོད་པ་བྱེད་དོ་ཞེས་ཀུན་ནས་མནར་སེམས་སྐྱེད་པ་དང་། གནོད་པ་བྱེད་པར་འགྱུར་རོ་ཞེས་ཀུན་ནས་མནར་སེམས་སྐྱེད་པ་དང་། བདག་གི་མཛའ་བོ་ལ་གནོད་པ་བྱས་སོ། ། བྱེད་དོ། ། བྱེད་པར་འགྱུར་རོ་ཞེས་སེམས་ལ་ཀུན་ནས་མནར་སེམས་སྐྱེད་པ་དང་། བདག་དང་མི་མཛའ་བའི་དོན་བྱས་སོ། ། བྱེད་དོ། ། བྱེད་པར་འགྱུར་རོ་ཞེས་ཀུན་ནས་མནར་སེམས་སྐྱེད་པའོ། །
en: “There are nine phenomena that are hinderances. What are they? They are thinking ‘I have been treated unjustly’ and giving rise to animosity, thinking ‘I am being treated unjustly’ and giving rise to animosity, thinking ‘I will be treated unjustly’ and giving rise to animosity, thinking ‘my dear ones have been, are being, or will be treated unjustly’ and giving rise to animosity, and thinking ‘my enemy has gained, is gaining, or will gain an advantage’ and giving rise to animosity.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡིན་ཏེ། འདི་ལྟ་སྟེ། སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ངག་རྩུབ་མོ་དང་། ཚིག་ཀྱལ་པ་དང་། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བའོ། །
en: “There are ten phenomena that are hinderances. What are they? They are the ten unwholesome forms of conduct: taking life, taking what is not given, sexual misconduct, lying, slander, uttering harsh words, inane chatter, covetousness, maliciousness, and holding wrong views.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པའི་ཀུན་ཏུ་སྦྱོར་བ་ཇི་སྙེད་པའི་ཆོས་དེ་དག་གིས་རོ་མྱང་བ་ལ་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་དང་། །ཕྱིན་ཅི་ལོག་དང་ལྡན་པ་དང་། འབྱུང་བ་ལ་ཀུན་ནས་ལྡང་བ་དང་། སྲེད་པ་དང་། ལྟ་བ་ལ་མངོན་པར་ཞེན་པའི་ཟང་ཟིང་དང་བཅས། ཕུང་པོ་དང་བཅས་པའི་ལུས་ཀྱི་ལས་དང་། ངག་གི་ལས་དང་། ཡིད་ཀྱི་ལས་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་བར་དུ་གཅོད་པར་མཁྱེན་ཏེ། བར་དུ་གཅོད་པར་མཁྱེན་ནས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་ཏོ། ། ཆོས་བཅུ་པོ་དེ་དག་ནི་བར་དུ་གཅོད་པར་འགྱུར་བ་སྟེ། དེ་དག་ཞི་བར་བྱ་བ་དང་། ཉེ་བར་ཞི་བར་བྱ་བ་དང་། སྤོང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་ཏོ། །
en: “In this way, Śāriputra, the Tathāgata knows that all restrictive phenomena that are related to superficial mental activity are disruptive, however many there may be. Their enjoyment is continually pursued. They keep one yoked to error. They keep one yoked to what is foul. They keep one habituated to having desires and views, to worldliness, to the material, to bodily action, to verbal action, and to mental action. He knows that they are disruptive and explains their true nature. These ten phenomena are hinderances, and the Tathāgata teaches the Dharma in order to calm them, to pacify them, to eliminate them.

source: དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་དེ་ཡང་འཁོར་ཐམས་ཅད་ཤེས་པར་བྱེད་པ། འཁོར་ཐམས་ཅད་མགུ་བར་བྱེད་པ། འཁོར་ཐམས་ཅད་ཀྱི་ལུས་སིམ་པར་བྱེད་པ། འཁོར་ཐམས་ཅད་ཀྱི་སེམས་ཚིམ་པ་སྐྱེད་པ། འཁོར་ཐམས་ཅད་དགའ་བ་དང་། རབ་ཏུ་དགའ་བ་དང་། དད་པ་སྐྱེད་པ་དང་། སྙིང་རྗེ་ཆེན་པོས་སྦྱོར་བ། དེ་བཞིན་ཉིད་ཀྱིས་མཉམ་པ། དེ་ཁོ་ན་ཉིད། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད། མི་འགྱུར་བ་ཉིད། མི་འཁྲུགས་པ་ཉིད། འབྱུང་བ་མེད་པ་ཉིད། འཇིག་པ་མེད་པ་ཉིད། རྩོད་པ་མེད་པ་ཉིད་དེ། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ལ་རྩོད་པ་གང་ཡང་མེད་དོ། ། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ནི་རྩོད་པ་མེད་པ་འཐབ་པ་མེད་པའོ། ། དེ་བཞིན་ཉིད་དང་མཉམ་ཞིང་ཆོས་ཀྱི་དབྱིངས་ངོས་མཉམ་པ། འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་མ་ལུས་པ་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་དོ། ། དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཚད་མེད། གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ། གཞལ་དུ་མེད། བརྗོད་དུ་མེད་པའི་ཆོས་དང་ལྡན་ཞིང་སྙིང་རྗེ་ཆེན་པོས་ཡང་དག་པར་ཟིན་པའི་སེམས་ཀྱིས་བར་དུ་གཅོད་པའི་ཆོས་རྣམས་ཞི་བར་བྱ་བ་དང་། སྤང་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: “This confidence of the Tathāgata is known in all assemblies. It satisfies all assemblies, refreshens all assemblies, exhilarates all assemblies, and gladdens, delights, and engages all assemblies. It is the practice of great compassion, and it is the same as the nature of things, real, actual, not inaccurate, unchanging, and imperturbable. It does not appear or perish. It is indisputable, as no one can dispute the confidence of the Tathāgata. One cannot challenge the indisputable confidence of the Tathāgata. It is the same as the nature of things, the same as the face of the totality of phenomena, unobstructed in all the vast stretches of the ten directions of the world. Thus, being in possession of immeasurable, innumerable, inconceivable, unequaled, inexpressible qualities and a mind filled with great compassion, the Tathāgata teaches the Dharma in order to calm, to pacify, and to eliminate.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་མཐའ་ཡས་མུ་མེད་པ་ནས་གང་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པའི་མཐའ་འདོད་པ་དེ་ནམ་མཁའི་མཐའ་འདོད་པ་ཞེས་བྱ་བའི་བར་དུ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ཐོས་ནས་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ་བ་ནས། ངོ་མཚར་དང་རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་དོ། ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་གསུམ་པ་སྟེ། མི་འཇིགས་པ་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་ནང་དུ་གཤེགས་ན་ཞེས་བྱ་བ་ནས། སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་ཞེས་བྱ་བའི་བར་དུའོ། །
en: “Thus, Śāriputra, the confidence of the Tathāgata is boundless. Just as space is boundless, Śāriputra, so, too, is the confidence of the Tathāgata boundless. Śāriputra, if one could claim that there is a limit to space, then one could also claim to find a limit to the Tathāgata’s confidence. When the bodhisatva learns of this inconceivable confidence of the Tathāgata, he develops great faith, trust, and confidence, and he has no uncertainty or doubt about it, and so forth. He considers it to be truly wondrous and extraordinary. This is the third tathāgata confidence, and in possession of this confidence the Tathāgata, and so forth, until as nobody in this world has legitimately turned.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པའི་ཡེ་ཤེས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་ལྡན་པས་སེམས་ཅན་རྣམས་གང་ལ་བསྟེན་པས་ངེས་པར་འབྱུང་བར་འགྱུར་བ་འཕགས་པའི་ངེས་པར་འབྱུང་བ་དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བའི་ལམ་རབ་ཏུ་མཁྱེན་ཏེ དེ་ལ་འདི་ནི་ངེས་པར་འབྱུང་བའི་ལམ་མ་ཡིན་ནོ། །
en: “Furthermore, Śāriputra, the Tathāgata possesses unsurpassed tathāgata knowledge, and he knows the path that is conducive to the noble deliverance that can genuinely eliminate suffering and that sentient beings can rely upon for deliverance.

source: ཞེས་དེ་བཞིན་གཤེགས་པ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཆོས་དང་འཐུན་པར་རྒོལ་བར་བྱེད་མི་ནུས་སོ། །
en: “The world with its gods, and so forth is not able to legitimately challenge the Tathāgata by saying, ‘This is not a path conducive to deliverance.’

source: ངེས་པར་འབྱུང་བའི་ལམ་གཅིག་སྟེ་གཅིག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བགྲོད་པ་གཅིག་པུའི་ལམ་སྟེ། གང་སེམས་ཅན་རྣམས་རྣམ་པར་དག་པར་འགྱུར་བའོ། །
en: “There is one path that is conducive to deliverance. What is it? It is the path to be tread alone that brings about the purification of sentient beings.

source: ངེས་པར་འབྱུང་བའི་ཆོས་གཉིས་ཏེ་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཞི་གནས་དང་། ལྷག་མཐོང་ངོ་། །
en: “There are two dharmas that are conducive to deliverance. What are they? They are calm abiding and insight meditation.

source: ངེས་པར་འབྱུང་བའི་ཆོས་གསུམ་སྟེ། གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའོ། །
en: “There are three dharmas that are conducive to deliverance. What are they? They are emptiness, freedom from attributes, and freedom from aspirations.

source: ངེས་པར་འབྱུང་བའི་ཆོས་བཞི་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་སུ་གཏོགས་པའི་དྲན་པ་དང་། ཚོར་བར་གཏོགས་པའི་དྲན་པ་དང་། སེམས་སུ་གཏོགས་པའི་དྲན་པ་དང་། ཆོས་སུ་གཏོགས་པའི་དྲན་པ་སྟེ་འདི་ནི་ངེས་པར་འབྱུང་བའི་ཆོས་བཞིའོ། །
en: “There are four dharmas that are conducive to deliverance. What are they? They are mindfulness of the body, mindfulness of feelings, mindfulness of the mind, and mindfulness of mental phenomena. These are the four dharmas that are conducive to deliverance.

source: ངེས་པར་འབྱུང་བའི་ཆོས་ལྔ་སྟེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ། འདི་ནི་ངེས་པར་འབྱུང་བའི་ཆོས་ལྔའོ། །
en: “There are five dharmas that are conducive to deliverance. What are they? They are the faculty of faith, the faculty of vigor, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom. These are the five dharmas that are conducive to deliverance.
